#include <iostream>
#include <array>
using namespace std;

//якщо дані поміщені в контейнер(и) STL можуть порівнюватись між собою, то і контейнери з такими даними
// можуть порівнюватись між собою
//у контейнерів STL присутня перегрузка операторів порівняння (==, !=, >, >=, <, <=)

int main()
{

	//те саме працює і з іншими контейнера бібліотеки STL

	array<int, 4> arr1 = { 1,94,77,10 };
	array<int, 4> arr2 = { 1,94,77,9 };

	//контейнери порівнюються поелементно 
	//проходяться по двох контейнерах і порівнюється кожен елемент поелементно,
	//якщо всі елементи між собою рівні, то поверне - true, інакше - false
	bool result = arr1 == arr2;
	//bool result = arr1 != arr2;
	cout << "result = arr1 == arr2 : " << result << endl;

	//якщо arr1 (>) більше за arr2, то результатом такої операції буде true, інакше false
	result = arr1 > arr2;
	cout << "result = arr1 > arr2 : " << result << endl;

	////Хотел спросить, как работает оператор > или меньше ? Он идет поэлементно до первого  неравенства ? или Как ?
	////	Пример
	//array<int, 4> a = { 1,4,1,1 };
	//array<int, 4> b = { 1,3,6,7 };
	////Подозреваю, что результат сравнения
	//cout << ((a > b) ? "true" : "false") << endl;
	////вернет "true", но хотелось бы подробнее узнать про это подробнее.
	////После видео я проверил, он действительно сравнивает до первого попавшегося неодинакового элемента.


	return 0;
}