#include <iostream>
#include <deque>
using namespace std;

//deque - це суміш масиву з двозв"язним списком
//в основі лежить двозв"язний список, але в якості даних виступають масиви невеликих розмірів

int main()
{

	deque<int> dq = { 1,9,94 };
	//dq.push_back(-1);
	//dq.push_front(-2);
	//dq.at(1);
	//dq[1];

	//ітератор довільного доступу, тому з допомогою ітератора можна рухатись по деку в абсолютно будь-якому  
	//напрямку і також отримати доступ до якогось конкретного елемента
	deque<int>::iterator it;

	return 0;
}