#include <iostream>
#include <string>

using namespace std;


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//ВІДМІННОСТІ МІЖ СТРУКТУРОЮ І КЛАСОМ:
//1. За замовчуванням поля і методи класу є private .Тобто не доступними на рівні екземпляру класу.
//   За замовчуванням поля і методи структури є public . Тобто доступними на рівні екземпляру структури.
//2. При наслідуванні одного класу від іншого класу і не вказано модифікатор доступу (за замовчуванням),
//    то поля і методи класу наслідуються як private .
//   При наслідуванні однієї структури від іншої структури і не вказано модифікатор доступу (за замовчуванням),
//    то поля і методи структури наслідуються як public .
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////


//поля і методи за замовчуваням - private
class MyClass1
{
//public:
    int a = 10; // = private: int a = 10;
    //void Print() { cout << a << endl; }
};
//class MyClass2 : MyClass1 = class MyClass2 : private MyClass1
class MyClass2 : public MyClass1
{

};


//поля і методи за замовчуваням - public
struct MyStruct1
{
    int a = 22; // = public: int a = 22;
    void Print() { cout << a << endl; }
};
//struct MyStruct2 : MyStruct1 = struct MyStruct2 : public MyStruct1
struct MyStruct2 : MyStruct1
{

};


int main()
{
    
    //MyClass mc;
    //MyStruct ms;


    return 0;
}